Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.UnsupportedTransformerPrimaryDS
[Distribution System Name] cannot appear on the primary side of the transformer.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.TransformerNoDistributionSystem
At least one of the distribution systems of Electrical Analytical Transformer [Name] is set to None. Assign distribution systems to the transformer.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.SecondaryNumOfPhasesNotEqualWithPrimary
Number of Phases of the secondary distribution system isn't equal with the primary distribution system's

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.PrimaryNumOfPhasesNotEqualWithSecondary
Number of Phases of the primary distribution system isn't equal with the secondary distribution system's

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsOnDataPanel
You can't connect to data panel [Panel Name] because there isn't enough space \nYou can increase the number of circuits to be greater than [Number].

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NoDistributionSystem
The distribution system of [CategoryName] [Name] is set to None. Assign a distribution system.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchDistributionSystem
[Name1] and [Name2] cannot connect with each other due to mismatched voltage or number of phases.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidNumberOfCircuitValueForDataPanel
The number of circuits on the data panel currently exceeds the value you entered for Maximum Amount of Circuits parameter. Reduce the number of circuits on the equipment before changing this value.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CircuitOverload
Total connected apparent power for Circuit [Name] is exceeding 80% of the defined rating ([Rating Value]).